op {
  input: "data"
  input: "conv1_w"
  input: "conv1_b"
  output: "conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 3
  }
  arg {
    name: "kernel"
    i: 7
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "conv1"
  input: "bn1_scale"
  input: "bn1_bias"
  input: "bn1_mean"
  input: "bn1_var"
  output: "bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "bn1"
  output: "bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "bn1"
  output: "pool1"
  type: "MaxPool"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "legacy_pad"
    i: 3
  }
}
op {
  input: "pool1"
  input: "pool1_conv1_w"
  input: "pool1_conv1_b"
  output: "pool1_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_conv1"
  input: "pool1_bn1_scale"
  input: "pool1_bn1_bias"
  input: "pool1_bn1_mean"
  input: "pool1_bn1_var"
  output: "pool1_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_bn1"
  output: "pool1_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "pool1_bn1"
  input: "pool1_conv2_w"
  input: "pool1_conv2_b"
  output: "pool1_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_conv2"
  input: "pool1_bn2_scale"
  input: "pool1_bn2_bias"
  input: "pool1_bn2_mean"
  input: "pool1_bn2_var"
  output: "pool1_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_bn2"
  output: "pool1_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "pool1_bn2"
  input: "pool1_conv3_w"
  input: "pool1_conv3_b"
  output: "pool1_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_conv3"
  input: "pool1_bn3_scale"
  input: "pool1_bn3_bias"
  input: "pool1_bn3_mean"
  input: "pool1_bn3_var"
  output: "pool1_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1"
  input: "pool1_res_conv_w"
  input: "pool1_res_conv_b"
  output: "pool1_res_conv"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_res_conv"
  input: "pool1_res_bn_scale"
  input: "pool1_res_bn_bias"
  input: "pool1_res_bn_mean"
  input: "pool1_res_bn_var"
  output: "pool1_res_bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_bn3"
  input: "pool1_res_bn"
  output: "pool1_block1"
  type: "Sum"
}
op {
  input: "pool1_block1"
  output: "pool1_block1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "pool1_block1"
  input: "pool1_block1_conv1_w"
  input: "pool1_block1_conv1_b"
  output: "pool1_block1_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block1_conv1"
  input: "pool1_block1_bn1_scale"
  input: "pool1_block1_bn1_bias"
  input: "pool1_block1_bn1_mean"
  input: "pool1_block1_bn1_var"
  output: "pool1_block1_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block1_bn1"
  output: "pool1_block1_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "pool1_block1_bn1"
  input: "pool1_block1_conv2_w"
  input: "pool1_block1_conv2_b"
  output: "pool1_block1_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block1_conv2"
  input: "pool1_block1_bn2_scale"
  input: "pool1_block1_bn2_bias"
  input: "pool1_block1_bn2_mean"
  input: "pool1_block1_bn2_var"
  output: "pool1_block1_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block1_bn2"
  output: "pool1_block1_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "pool1_block1_bn2"
  input: "pool1_block1_conv3_w"
  input: "pool1_block1_conv3_b"
  output: "pool1_block1_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block1_conv3"
  input: "pool1_block1_bn3_scale"
  input: "pool1_block1_bn3_bias"
  input: "pool1_block1_bn3_mean"
  input: "pool1_block1_bn3_var"
  output: "pool1_block1_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block1_bn3"
  input: "pool1_block1"
  output: "pool1_block2"
  type: "Sum"
}
op {
  input: "pool1_block2"
  output: "pool1_block2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "pool1_block2"
  input: "pool1_block2_conv1_w"
  input: "pool1_block2_conv1_b"
  output: "pool1_block2_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block2_conv1"
  input: "pool1_block2_bn1_scale"
  input: "pool1_block2_bn1_bias"
  input: "pool1_block2_bn1_mean"
  input: "pool1_block2_bn1_var"
  output: "pool1_block2_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block2_bn1"
  output: "pool1_block2_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "pool1_block2_bn1"
  input: "pool1_block2_conv2_w"
  input: "pool1_block2_conv2_b"
  output: "pool1_block2_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block2_conv2"
  input: "pool1_block2_bn2_scale"
  input: "pool1_block2_bn2_bias"
  input: "pool1_block2_bn2_mean"
  input: "pool1_block2_bn2_var"
  output: "pool1_block2_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block2_bn2"
  output: "pool1_block2_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "pool1_block2_bn2"
  input: "pool1_block2_conv3_w"
  input: "pool1_block2_conv3_b"
  output: "pool1_block2_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block2_conv3"
  input: "pool1_block2_bn3_scale"
  input: "pool1_block2_bn3_bias"
  input: "pool1_block2_bn3_mean"
  input: "pool1_block2_bn3_var"
  output: "pool1_block2_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "pool1_block2_bn3"
  input: "pool1_block2"
  output: "block1"
  type: "Sum"
}
op {
  input: "block1"
  output: "block1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1"
  input: "block1_conv1_w"
  input: "block1_conv1_b"
  output: "block1_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_conv1"
  input: "block1_bn1_scale"
  input: "block1_bn1_bias"
  input: "block1_bn1_mean"
  input: "block1_bn1_var"
  output: "block1_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_bn1"
  output: "block1_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_bn1"
  input: "block1_conv2_w"
  input: "block1_conv2_b"
  output: "block1_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_conv2"
  input: "block1_bn2_scale"
  input: "block1_bn2_bias"
  input: "block1_bn2_mean"
  input: "block1_bn2_var"
  output: "block1_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_bn2"
  output: "block1_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_bn2"
  input: "block1_conv3_w"
  input: "block1_conv3_b"
  output: "block1_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_conv3"
  input: "block1_bn3_scale"
  input: "block1_bn3_bias"
  input: "block1_bn3_mean"
  input: "block1_bn3_var"
  output: "block1_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1"
  input: "block1_res_conv_w"
  input: "block1_res_conv_b"
  output: "block1_res_conv"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_res_conv"
  input: "block1_res_bn_scale"
  input: "block1_res_bn_bias"
  input: "block1_res_bn_mean"
  input: "block1_res_bn_var"
  output: "block1_res_bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_bn3"
  input: "block1_res_bn"
  output: "block1_block1"
  type: "Sum"
}
op {
  input: "block1_block1"
  output: "block1_block1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block1"
  input: "block1_block1_conv1_w"
  input: "block1_block1_conv1_b"
  output: "block1_block1_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block1_conv1"
  input: "block1_block1_bn1_scale"
  input: "block1_block1_bn1_bias"
  input: "block1_block1_bn1_mean"
  input: "block1_block1_bn1_var"
  output: "block1_block1_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block1_bn1"
  output: "block1_block1_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block1_bn1"
  input: "block1_block1_conv2_w"
  input: "block1_block1_conv2_b"
  output: "block1_block1_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block1_conv2"
  input: "block1_block1_bn2_scale"
  input: "block1_block1_bn2_bias"
  input: "block1_block1_bn2_mean"
  input: "block1_block1_bn2_var"
  output: "block1_block1_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block1_bn2"
  output: "block1_block1_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block1_bn2"
  input: "block1_block1_conv3_w"
  input: "block1_block1_conv3_b"
  output: "block1_block1_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block1_conv3"
  input: "block1_block1_bn3_scale"
  input: "block1_block1_bn3_bias"
  input: "block1_block1_bn3_mean"
  input: "block1_block1_bn3_var"
  output: "block1_block1_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block1_bn3"
  input: "block1_block1"
  output: "block1_block2"
  type: "Sum"
}
op {
  input: "block1_block2"
  output: "block1_block2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block2"
  input: "block1_block2_conv1_w"
  input: "block1_block2_conv1_b"
  output: "block1_block2_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block2_conv1"
  input: "block1_block2_bn1_scale"
  input: "block1_block2_bn1_bias"
  input: "block1_block2_bn1_mean"
  input: "block1_block2_bn1_var"
  output: "block1_block2_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block2_bn1"
  output: "block1_block2_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block2_bn1"
  input: "block1_block2_conv2_w"
  input: "block1_block2_conv2_b"
  output: "block1_block2_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block2_conv2"
  input: "block1_block2_bn2_scale"
  input: "block1_block2_bn2_bias"
  input: "block1_block2_bn2_mean"
  input: "block1_block2_bn2_var"
  output: "block1_block2_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block2_bn2"
  output: "block1_block2_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block2_bn2"
  input: "block1_block2_conv3_w"
  input: "block1_block2_conv3_b"
  output: "block1_block2_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block2_conv3"
  input: "block1_block2_bn3_scale"
  input: "block1_block2_bn3_bias"
  input: "block1_block2_bn3_mean"
  input: "block1_block2_bn3_var"
  output: "block1_block2_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block2_bn3"
  input: "block1_block2"
  output: "block1_block3"
  type: "Sum"
}
op {
  input: "block1_block3"
  output: "block1_block3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block3"
  input: "block1_block3_conv1_w"
  input: "block1_block3_conv1_b"
  output: "block1_block3_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block3_conv1"
  input: "block1_block3_bn1_scale"
  input: "block1_block3_bn1_bias"
  input: "block1_block3_bn1_mean"
  input: "block1_block3_bn1_var"
  output: "block1_block3_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block3_bn1"
  output: "block1_block3_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block3_bn1"
  input: "block1_block3_conv2_w"
  input: "block1_block3_conv2_b"
  output: "block1_block3_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block3_conv2"
  input: "block1_block3_bn2_scale"
  input: "block1_block3_bn2_bias"
  input: "block1_block3_bn2_mean"
  input: "block1_block3_bn2_var"
  output: "block1_block3_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block3_bn2"
  output: "block1_block3_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block3_bn2"
  input: "block1_block3_conv3_w"
  input: "block1_block3_conv3_b"
  output: "block1_block3_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block3_conv3"
  input: "block1_block3_bn3_scale"
  input: "block1_block3_bn3_bias"
  input: "block1_block3_bn3_mean"
  input: "block1_block3_bn3_var"
  output: "block1_block3_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block3_bn3"
  input: "block1_block3"
  output: "block1_block4"
  type: "Sum"
}
op {
  input: "block1_block4"
  output: "block1_block4"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block4"
  input: "block1_block4_conv1_w"
  input: "block1_block4_conv1_b"
  output: "block1_block4_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block4_conv1"
  input: "block1_block4_bn1_scale"
  input: "block1_block4_bn1_bias"
  input: "block1_block4_bn1_mean"
  input: "block1_block4_bn1_var"
  output: "block1_block4_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block4_bn1"
  output: "block1_block4_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block4_bn1"
  input: "block1_block4_conv2_w"
  input: "block1_block4_conv2_b"
  output: "block1_block4_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block4_conv2"
  input: "block1_block4_bn2_scale"
  input: "block1_block4_bn2_bias"
  input: "block1_block4_bn2_mean"
  input: "block1_block4_bn2_var"
  output: "block1_block4_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block4_bn2"
  output: "block1_block4_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block4_bn2"
  input: "block1_block4_conv3_w"
  input: "block1_block4_conv3_b"
  output: "block1_block4_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block4_conv3"
  input: "block1_block4_bn3_scale"
  input: "block1_block4_bn3_bias"
  input: "block1_block4_bn3_mean"
  input: "block1_block4_bn3_var"
  output: "block1_block4_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block4_bn3"
  input: "block1_block4"
  output: "block1_block5"
  type: "Sum"
}
op {
  input: "block1_block5"
  output: "block1_block5"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block5"
  input: "block1_block5_conv1_w"
  input: "block1_block5_conv1_b"
  output: "block1_block5_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block5_conv1"
  input: "block1_block5_bn1_scale"
  input: "block1_block5_bn1_bias"
  input: "block1_block5_bn1_mean"
  input: "block1_block5_bn1_var"
  output: "block1_block5_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block5_bn1"
  output: "block1_block5_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block5_bn1"
  input: "block1_block5_conv2_w"
  input: "block1_block5_conv2_b"
  output: "block1_block5_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block5_conv2"
  input: "block1_block5_bn2_scale"
  input: "block1_block5_bn2_bias"
  input: "block1_block5_bn2_mean"
  input: "block1_block5_bn2_var"
  output: "block1_block5_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block5_bn2"
  output: "block1_block5_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block5_bn2"
  input: "block1_block5_conv3_w"
  input: "block1_block5_conv3_b"
  output: "block1_block5_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block5_conv3"
  input: "block1_block5_bn3_scale"
  input: "block1_block5_bn3_bias"
  input: "block1_block5_bn3_mean"
  input: "block1_block5_bn3_var"
  output: "block1_block5_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block5_bn3"
  input: "block1_block5"
  output: "block1_block6"
  type: "Sum"
}
op {
  input: "block1_block6"
  output: "block1_block6"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block6"
  input: "block1_block6_conv1_w"
  input: "block1_block6_conv1_b"
  output: "block1_block6_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block6_conv1"
  input: "block1_block6_bn1_scale"
  input: "block1_block6_bn1_bias"
  input: "block1_block6_bn1_mean"
  input: "block1_block6_bn1_var"
  output: "block1_block6_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block6_bn1"
  output: "block1_block6_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block6_bn1"
  input: "block1_block6_conv2_w"
  input: "block1_block6_conv2_b"
  output: "block1_block6_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block6_conv2"
  input: "block1_block6_bn2_scale"
  input: "block1_block6_bn2_bias"
  input: "block1_block6_bn2_mean"
  input: "block1_block6_bn2_var"
  output: "block1_block6_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block6_bn2"
  output: "block1_block6_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block6_bn2"
  input: "block1_block6_conv3_w"
  input: "block1_block6_conv3_b"
  output: "block1_block6_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block6_conv3"
  input: "block1_block6_bn3_scale"
  input: "block1_block6_bn3_bias"
  input: "block1_block6_bn3_mean"
  input: "block1_block6_bn3_var"
  output: "block1_block6_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block6_bn3"
  input: "block1_block6"
  output: "block1_block7"
  type: "Sum"
}
op {
  input: "block1_block7"
  output: "block1_block7"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block7"
  input: "block1_block7_conv1_w"
  input: "block1_block7_conv1_b"
  output: "block1_block7_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block7_conv1"
  input: "block1_block7_bn1_scale"
  input: "block1_block7_bn1_bias"
  input: "block1_block7_bn1_mean"
  input: "block1_block7_bn1_var"
  output: "block1_block7_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block7_bn1"
  output: "block1_block7_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block7_bn1"
  input: "block1_block7_conv2_w"
  input: "block1_block7_conv2_b"
  output: "block1_block7_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block7_conv2"
  input: "block1_block7_bn2_scale"
  input: "block1_block7_bn2_bias"
  input: "block1_block7_bn2_mean"
  input: "block1_block7_bn2_var"
  output: "block1_block7_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block7_bn2"
  output: "block1_block7_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block1_block7_bn2"
  input: "block1_block7_conv3_w"
  input: "block1_block7_conv3_b"
  output: "block1_block7_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block7_conv3"
  input: "block1_block7_bn3_scale"
  input: "block1_block7_bn3_bias"
  input: "block1_block7_bn3_mean"
  input: "block1_block7_bn3_var"
  output: "block1_block7_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block1_block7_bn3"
  input: "block1_block7"
  output: "block2"
  type: "Sum"
}
op {
  input: "block2"
  output: "block2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2"
  input: "block2_conv1_w"
  input: "block2_conv1_b"
  output: "block2_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_conv1"
  input: "block2_bn1_scale"
  input: "block2_bn1_bias"
  input: "block2_bn1_mean"
  input: "block2_bn1_var"
  output: "block2_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_bn1"
  output: "block2_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_bn1"
  input: "block2_conv2_w"
  input: "block2_conv2_b"
  output: "block2_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_conv2"
  input: "block2_bn2_scale"
  input: "block2_bn2_bias"
  input: "block2_bn2_mean"
  input: "block2_bn2_var"
  output: "block2_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_bn2"
  output: "block2_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_bn2"
  input: "block2_conv3_w"
  input: "block2_conv3_b"
  output: "block2_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_conv3"
  input: "block2_bn3_scale"
  input: "block2_bn3_bias"
  input: "block2_bn3_mean"
  input: "block2_bn3_var"
  output: "block2_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2"
  input: "block2_res_conv_w"
  input: "block2_res_conv_b"
  output: "block2_res_conv"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_res_conv"
  input: "block2_res_bn_scale"
  input: "block2_res_bn_bias"
  input: "block2_res_bn_mean"
  input: "block2_res_bn_var"
  output: "block2_res_bn"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_bn3"
  input: "block2_res_bn"
  output: "block2_block1"
  type: "Sum"
}
op {
  input: "block2_block1"
  output: "block2_block1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block1"
  input: "block2_block1_conv1_w"
  input: "block2_block1_conv1_b"
  output: "block2_block1_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block1_conv1"
  input: "block2_block1_bn1_scale"
  input: "block2_block1_bn1_bias"
  input: "block2_block1_bn1_mean"
  input: "block2_block1_bn1_var"
  output: "block2_block1_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block1_bn1"
  output: "block2_block1_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block1_bn1"
  input: "block2_block1_conv2_w"
  input: "block2_block1_conv2_b"
  output: "block2_block1_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block1_conv2"
  input: "block2_block1_bn2_scale"
  input: "block2_block1_bn2_bias"
  input: "block2_block1_bn2_mean"
  input: "block2_block1_bn2_var"
  output: "block2_block1_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block1_bn2"
  output: "block2_block1_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block1_bn2"
  input: "block2_block1_conv3_w"
  input: "block2_block1_conv3_b"
  output: "block2_block1_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block1_conv3"
  input: "block2_block1_bn3_scale"
  input: "block2_block1_bn3_bias"
  input: "block2_block1_bn3_mean"
  input: "block2_block1_bn3_var"
  output: "block2_block1_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block1_bn3"
  input: "block2_block1"
  output: "block2_block2"
  type: "Sum"
}
op {
  input: "block2_block2"
  output: "block2_block2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block2"
  input: "block2_block2_conv1_w"
  input: "block2_block2_conv1_b"
  output: "block2_block2_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block2_conv1"
  input: "block2_block2_bn1_scale"
  input: "block2_block2_bn1_bias"
  input: "block2_block2_bn1_mean"
  input: "block2_block2_bn1_var"
  output: "block2_block2_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block2_bn1"
  output: "block2_block2_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block2_bn1"
  input: "block2_block2_conv2_w"
  input: "block2_block2_conv2_b"
  output: "block2_block2_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block2_conv2"
  input: "block2_block2_bn2_scale"
  input: "block2_block2_bn2_bias"
  input: "block2_block2_bn2_mean"
  input: "block2_block2_bn2_var"
  output: "block2_block2_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block2_bn2"
  output: "block2_block2_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block2_bn2"
  input: "block2_block2_conv3_w"
  input: "block2_block2_conv3_b"
  output: "block2_block2_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block2_conv3"
  input: "block2_block2_bn3_scale"
  input: "block2_block2_bn3_bias"
  input: "block2_block2_bn3_mean"
  input: "block2_block2_bn3_var"
  output: "block2_block2_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block2_bn3"
  input: "block2_block2"
  output: "block2_block3"
  type: "Sum"
}
op {
  input: "block2_block3"
  output: "block2_block3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block3"
  input: "block2_block3_conv1_w"
  input: "block2_block3_conv1_b"
  output: "block2_block3_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block3_conv1"
  input: "block2_block3_bn1_scale"
  input: "block2_block3_bn1_bias"
  input: "block2_block3_bn1_mean"
  input: "block2_block3_bn1_var"
  output: "block2_block3_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block3_bn1"
  output: "block2_block3_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block3_bn1"
  input: "block2_block3_conv2_w"
  input: "block2_block3_conv2_b"
  output: "block2_block3_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block3_conv2"
  input: "block2_block3_bn2_scale"
  input: "block2_block3_bn2_bias"
  input: "block2_block3_bn2_mean"
  input: "block2_block3_bn2_var"
  output: "block2_block3_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block3_bn2"
  output: "block2_block3_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block3_bn2"
  input: "block2_block3_conv3_w"
  input: "block2_block3_conv3_b"
  output: "block2_block3_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block3_conv3"
  input: "block2_block3_bn3_scale"
  input: "block2_block3_bn3_bias"
  input: "block2_block3_bn3_mean"
  input: "block2_block3_bn3_var"
  output: "block2_block3_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block3_bn3"
  input: "block2_block3"
  output: "block2_block4"
  type: "Sum"
}
op {
  input: "block2_block4"
  output: "block2_block4"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block4"
  input: "block2_block4_conv1_w"
  input: "block2_block4_conv1_b"
  output: "block2_block4_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block4_conv1"
  input: "block2_block4_bn1_scale"
  input: "block2_block4_bn1_bias"
  input: "block2_block4_bn1_mean"
  input: "block2_block4_bn1_var"
  output: "block2_block4_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block4_bn1"
  output: "block2_block4_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block4_bn1"
  input: "block2_block4_conv2_w"
  input: "block2_block4_conv2_b"
  output: "block2_block4_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block4_conv2"
  input: "block2_block4_bn2_scale"
  input: "block2_block4_bn2_bias"
  input: "block2_block4_bn2_mean"
  input: "block2_block4_bn2_var"
  output: "block2_block4_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block4_bn2"
  output: "block2_block4_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block4_bn2"
  input: "block2_block4_conv3_w"
  input: "block2_block4_conv3_b"
  output: "block2_block4_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block4_conv3"
  input: "block2_block4_bn3_scale"
  input: "block2_block4_bn3_bias"
  input: "block2_block4_bn3_mean"
  input: "block2_block4_bn3_var"
  output: "block2_block4_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block4_bn3"
  input: "block2_block4"
  output: "block2_block5"
  type: "Sum"
}
op {
  input: "block2_block5"
  output: "block2_block5"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block5"
  input: "block2_block5_conv1_w"
  input: "block2_block5_conv1_b"
  output: "block2_block5_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block5_conv1"
  input: "block2_block5_bn1_scale"
  input: "block2_block5_bn1_bias"
  input: "block2_block5_bn1_mean"
  input: "block2_block5_bn1_var"
  output: "block2_block5_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block5_bn1"
  output: "block2_block5_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block5_bn1"
  input: "block2_block5_conv2_w"
  input: "block2_block5_conv2_b"
  output: "block2_block5_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block5_conv2"
  input: "block2_block5_bn2_scale"
  input: "block2_block5_bn2_bias"
  input: "block2_block5_bn2_mean"
  input: "block2_block5_bn2_var"
  output: "block2_block5_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block5_bn2"
  output: "block2_block5_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block5_bn2"
  input: "block2_block5_conv3_w"
  input: "block2_block5_conv3_b"
  output: "block2_block5_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block5_conv3"
  input: "block2_block5_bn3_scale"
  input: "block2_block5_bn3_bias"
  input: "block2_block5_bn3_mean"
  input: "block2_block5_bn3_var"
  output: "block2_block5_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block5_bn3"
  input: "block2_block5"
  output: "block2_block6"
  type: "Sum"
}
op {
  input: "block2_block6"
  output: "block2_block6"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block6"
  input: "block2_block6_conv1_w"
  input: "block2_block6_conv1_b"
  output: "block2_block6_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block6_conv1"
  input: "block2_block6_bn1_scale"
  input: "block2_block6_bn1_bias"
  input: "block2_block6_bn1_mean"
  input: "block2_block6_bn1_var"
  output: "block2_block6_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block6_bn1"
  output: "block2_block6_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block6_bn1"
  input: "block2_block6_conv2_w"
  input: "block2_block6_conv2_b"
  output: "block2_block6_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block6_conv2"
  input: "block2_block6_bn2_scale"
  input: "block2_block6_bn2_bias"
  input: "block2_block6_bn2_mean"
  input: "block2_block6_bn2_var"
  output: "block2_block6_bn2"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block6_bn2"
  output: "block2_block6_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block6_bn2"
  input: "block2_block6_conv3_w"
  input: "block2_block6_conv3_b"
  output: "block2_block6_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block6_conv3"
  input: "block2_block6_bn3_scale"
  input: "block2_block6_bn3_bias"
  input: "block2_block6_bn3_mean"
  input: "block2_block6_bn3_var"
  output: "block2_block6_bn3"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block6_bn3"
  input: "block2_block6"
  output: "block2_block7"
  type: "Sum"
}
op {
  input: "block2_block7"
  output: "block2_block7"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block7"
  input: "block2_block7_conv1_w"
  input: "block2_block7_conv1_b"
  output: "block2_block7_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block7_conv1"
  input: "block2_block7_bn1_scale"
  input: "block2_block7_bn1_bias"
  input: "block2_block7_bn1_mean"
  input: "block2_block7_bn1_var"
  output: "block2_block7_bn1"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 1
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block7_bn1"
  output: "block2_block7_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "block2_block7_bn1"
  input: "block2_block7_conv2_w"
  input: "block2_block7_conv2_b"
  output: "block2_block7_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "block2_block7_conv2"
  input: "block2_block7_bn2_scale"
  input: "block2_block7_bn2_bias"
  input: "block2_block7_bn2_mean"
