op {
  input: "data"
  input: "data_conv1_w"
  input: "data_conv1_b"
  output: "data_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 3
  }
  arg {
    name: "kernel"
    i: 7
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_conv1"
  input: "data_bn1_scale"
  input: "data_bn1_bias"
  input: "data_bn1_mean"
  input: "data_bn1_var"
  output: "data_bn1"
  output: "data_bn1_mean"
  output: "data_bn1_var"
  output: "data_bn1_saved_mean"
  output: "data_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_bn1"
  output: "data_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "data_bn1"
  input: "data_bn1_bn1_scale"
  input: "data_bn1_bn1_bias"
  input: "data_bn1_bn1_mean"
  input: "data_bn1_bn1_var"
  output: "data_bn1_bn1"
  output: "data_bn1_bn1_mean"
  output: "data_bn1_bn1_var"
  output: "data_bn1_bn1_saved_mean"
  output: "data_bn1_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_bn1_bn1"
  output: "data_bn1_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "data_bn1_bn1"
  input: "data_bn1_conv1_w"
  input: "data_bn1_conv1_b"
  output: "data_bn1_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_bn1_conv1"
  input: "data_bn1_bn2_scale"
  input: "data_bn1_bn2_bias"
  input: "data_bn1_bn2_mean"
  input: "data_bn1_bn2_var"
  output: "data_bn1_bn2"
  output: "data_bn1_bn2_mean"
  output: "data_bn1_bn2_var"
  output: "data_bn1_bn2_saved_mean"
  output: "data_bn1_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_bn1_bn2"
  output: "data_bn1_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "data_bn1_bn2"
  input: "data_bn1_conv2_w"
  input: "data_bn1_conv2_b"
  output: "data_bn1_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_bn1_conv2"
  input: "data_bn1_bn3_scale"
  input: "data_bn1_bn3_bias"
  input: "data_bn1_bn3_mean"
  input: "data_bn1_bn3_var"
  output: "data_bn1_bn3"
  output: "data_bn1_bn3_mean"
  output: "data_bn1_bn3_var"
  output: "data_bn1_bn3_saved_mean"
  output: "data_bn1_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_bn1_bn3"
  output: "data_bn1_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "data_bn1_bn3"
  input: "data_bn1_conv3_w"
  input: "data_bn1_conv3_b"
  output: "data_bn1_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_bn1_conv1"
  input: "data_bn1_conv2"
  input: "data_bn1_conv3"
  output: "convblock1"
  output: "_convblock1_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_bn1"
  input: "data_bn1_res_bn_scale"
  input: "data_bn1_res_bn_bias"
  input: "data_bn1_res_bn_mean"
  input: "data_bn1_res_bn_var"
  output: "data_bn1_res_bn"
  output: "data_bn1_res_bn_mean"
  output: "data_bn1_res_bn_var"
  output: "data_bn1_res_bn_saved_mean"
  output: "data_bn1_res_bn_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "data_bn1_res_bn"
  output: "data_bn1_res_bn"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "data_bn1_res_bn"
  input: "data_bn1_res_conv_w"
  input: "data_bn1_res_conv_b"
  output: "data_bn1_res_conv"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock1"
  input: "data_bn1_res_conv"
  output: "convblock1"
  type: "Sum"
}
op {
  input: "convblock1"
  output: "convblock1_pool"
  type: "AveragePool"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 2
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "legacy_pad"
    i: 3
  }
}
op {
  input: "convblock1_pool"
  input: "convblock1_pool_bn1_scale"
  input: "convblock1_pool_bn1_bias"
  input: "convblock1_pool_bn1_mean"
  input: "convblock1_pool_bn1_var"
  output: "convblock1_pool_bn1"
  output: "convblock1_pool_bn1_mean"
  output: "convblock1_pool_bn1_var"
  output: "convblock1_pool_bn1_saved_mean"
  output: "convblock1_pool_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock1_pool_bn1"
  output: "convblock1_pool_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock1_pool_bn1"
  input: "convblock1_pool_conv1_w"
  input: "convblock1_pool_conv1_b"
  output: "convblock1_pool_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock1_pool_conv1"
  input: "convblock1_pool_bn2_scale"
  input: "convblock1_pool_bn2_bias"
  input: "convblock1_pool_bn2_mean"
  input: "convblock1_pool_bn2_var"
  output: "convblock1_pool_bn2"
  output: "convblock1_pool_bn2_mean"
  output: "convblock1_pool_bn2_var"
  output: "convblock1_pool_bn2_saved_mean"
  output: "convblock1_pool_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock1_pool_bn2"
  output: "convblock1_pool_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock1_pool_bn2"
  input: "convblock1_pool_conv2_w"
  input: "convblock1_pool_conv2_b"
  output: "convblock1_pool_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock1_pool_conv2"
  input: "convblock1_pool_bn3_scale"
  input: "convblock1_pool_bn3_bias"
  input: "convblock1_pool_bn3_mean"
  input: "convblock1_pool_bn3_var"
  output: "convblock1_pool_bn3"
  output: "convblock1_pool_bn3_mean"
  output: "convblock1_pool_bn3_var"
  output: "convblock1_pool_bn3_saved_mean"
  output: "convblock1_pool_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock1_pool_bn3"
  output: "convblock1_pool_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock1_pool_bn3"
  input: "convblock1_pool_conv3_w"
  input: "convblock1_pool_conv3_b"
  output: "convblock1_pool_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock1_pool_conv1"
  input: "convblock1_pool_conv2"
  input: "convblock1_pool_conv3"
  output: "convblock2"
  output: "_convblock2_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock2"
  input: "convblock2_bn1_scale"
  input: "convblock2_bn1_bias"
  input: "convblock2_bn1_mean"
  input: "convblock2_bn1_var"
  output: "convblock2_bn1"
  output: "convblock2_bn1_mean"
  output: "convblock2_bn1_var"
  output: "convblock2_bn1_saved_mean"
  output: "convblock2_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock2_bn1"
  output: "convblock2_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock2_bn1"
  input: "convblock2_conv1_w"
  input: "convblock2_conv1_b"
  output: "convblock2_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock2_conv1"
  input: "convblock2_bn2_scale"
  input: "convblock2_bn2_bias"
  input: "convblock2_bn2_mean"
  input: "convblock2_bn2_var"
  output: "convblock2_bn2"
  output: "convblock2_bn2_mean"
  output: "convblock2_bn2_var"
  output: "convblock2_bn2_saved_mean"
  output: "convblock2_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock2_bn2"
  output: "convblock2_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock2_bn2"
  input: "convblock2_conv2_w"
  input: "convblock2_conv2_b"
  output: "convblock2_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock2_conv2"
  input: "convblock2_bn3_scale"
  input: "convblock2_bn3_bias"
  input: "convblock2_bn3_mean"
  input: "convblock2_bn3_var"
  output: "convblock2_bn3"
  output: "convblock2_bn3_mean"
  output: "convblock2_bn3_var"
  output: "convblock2_bn3_saved_mean"
  output: "convblock2_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock2_bn3"
  output: "convblock2_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock2_bn3"
  input: "convblock2_conv3_w"
  input: "convblock2_conv3_b"
  output: "convblock2_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock2_conv1"
  input: "convblock2_conv2"
  input: "convblock2_conv3"
  output: "convblock3"
  output: "_convblock3_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock2"
  input: "convblock2_res_bn_scale"
  input: "convblock2_res_bn_bias"
  input: "convblock2_res_bn_mean"
  input: "convblock2_res_bn_var"
  output: "convblock2_res_bn"
  output: "convblock2_res_bn_mean"
  output: "convblock2_res_bn_var"
  output: "convblock2_res_bn_saved_mean"
  output: "convblock2_res_bn_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock2_res_bn"
  output: "convblock2_res_bn"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock2_res_bn"
  input: "convblock2_res_conv_w"
  input: "convblock2_res_conv_b"
  output: "convblock2_res_conv"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 1
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3"
  input: "convblock2_res_conv"
  output: "convblock3"
  type: "Sum"
}
op {
  input: "convblock3"
  input: "convblock3_bn1_scale"
  input: "convblock3_bn1_bias"
  input: "convblock3_bn1_mean"
  input: "convblock3_bn1_var"
  output: "convblock3_bn1"
  output: "convblock3_bn1_mean"
  output: "convblock3_bn1_var"
  output: "convblock3_bn1_saved_mean"
  output: "convblock3_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_bn1"
  output: "convblock3_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_bn1"
  input: "convblock3_conv1_w"
  input: "convblock3_conv1_b"
  output: "convblock3_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_conv1"
  input: "convblock3_bn2_scale"
  input: "convblock3_bn2_bias"
  input: "convblock3_bn2_mean"
  input: "convblock3_bn2_var"
  output: "convblock3_bn2"
  output: "convblock3_bn2_mean"
  output: "convblock3_bn2_var"
  output: "convblock3_bn2_saved_mean"
  output: "convblock3_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_bn2"
  output: "convblock3_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_bn2"
  input: "convblock3_conv2_w"
  input: "convblock3_conv2_b"
  output: "convblock3_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_conv2"
  input: "convblock3_bn3_scale"
  input: "convblock3_bn3_bias"
  input: "convblock3_bn3_mean"
  input: "convblock3_bn3_var"
  output: "convblock3_bn3"
  output: "convblock3_bn3_mean"
  output: "convblock3_bn3_var"
  output: "convblock3_bn3_saved_mean"
  output: "convblock3_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_bn3"
  output: "convblock3_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_bn3"
  input: "convblock3_conv3_w"
  input: "convblock3_conv3_b"
  output: "convblock3_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_conv1"
  input: "convblock3_conv2"
  input: "convblock3_conv3"
  output: "convblock3_l4_b1"
  output: "_convblock3_l4_b1_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3"
  output: "convblock3_l4_b2_downsample"
  type: "AveragePool"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 2
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "legacy_pad"
    i: 3
  }
}
op {
  input: "convblock3_l4_b2_downsample"
  input: "convblock3_l4_b2_downsample_bn1_scale"
  input: "convblock3_l4_b2_downsample_bn1_bias"
  input: "convblock3_l4_b2_downsample_bn1_mean"
  input: "convblock3_l4_b2_downsample_bn1_var"
  output: "convblock3_l4_b2_downsample_bn1"
  output: "convblock3_l4_b2_downsample_bn1_mean"
  output: "convblock3_l4_b2_downsample_bn1_var"
  output: "convblock3_l4_b2_downsample_bn1_saved_mean"
  output: "convblock3_l4_b2_downsample_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l4_b2_downsample_bn1"
  output: "convblock3_l4_b2_downsample_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l4_b2_downsample_bn1"
  input: "convblock3_l4_b2_downsample_conv1_w"
  input: "convblock3_l4_b2_downsample_conv1_b"
  output: "convblock3_l4_b2_downsample_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l4_b2_downsample_conv1"
  input: "convblock3_l4_b2_downsample_bn2_scale"
  input: "convblock3_l4_b2_downsample_bn2_bias"
  input: "convblock3_l4_b2_downsample_bn2_mean"
  input: "convblock3_l4_b2_downsample_bn2_var"
  output: "convblock3_l4_b2_downsample_bn2"
  output: "convblock3_l4_b2_downsample_bn2_mean"
  output: "convblock3_l4_b2_downsample_bn2_var"
  output: "convblock3_l4_b2_downsample_bn2_saved_mean"
  output: "convblock3_l4_b2_downsample_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l4_b2_downsample_bn2"
  output: "convblock3_l4_b2_downsample_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l4_b2_downsample_bn2"
  input: "convblock3_l4_b2_downsample_conv2_w"
  input: "convblock3_l4_b2_downsample_conv2_b"
  output: "convblock3_l4_b2_downsample_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l4_b2_downsample_conv2"
  input: "convblock3_l4_b2_downsample_bn3_scale"
  input: "convblock3_l4_b2_downsample_bn3_bias"
  input: "convblock3_l4_b2_downsample_bn3_mean"
  input: "convblock3_l4_b2_downsample_bn3_var"
  output: "convblock3_l4_b2_downsample_bn3"
  output: "convblock3_l4_b2_downsample_bn3_mean"
  output: "convblock3_l4_b2_downsample_bn3_var"
  output: "convblock3_l4_b2_downsample_bn3_saved_mean"
  output: "convblock3_l4_b2_downsample_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l4_b2_downsample_bn3"
  output: "convblock3_l4_b2_downsample_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l4_b2_downsample_bn3"
  input: "convblock3_l4_b2_downsample_conv3_w"
  input: "convblock3_l4_b2_downsample_conv3_b"
  output: "convblock3_l4_b2_downsample_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l4_b2_downsample_conv1"
  input: "convblock3_l4_b2_downsample_conv2"
  input: "convblock3_l4_b2_downsample_conv3"
  output: "convblock3_l3_input"
  output: "_convblock3_l3_input_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input"
  input: "convblock3_l3_input_bn1_scale"
  input: "convblock3_l3_input_bn1_bias"
  input: "convblock3_l3_input_bn1_mean"
  input: "convblock3_l3_input_bn1_var"
  output: "convblock3_l3_input_bn1"
  output: "convblock3_l3_input_bn1_mean"
  output: "convblock3_l3_input_bn1_var"
  output: "convblock3_l3_input_bn1_saved_mean"
  output: "convblock3_l3_input_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_bn1"
  output: "convblock3_l3_input_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_bn1"
  input: "convblock3_l3_input_conv1_w"
  input: "convblock3_l3_input_conv1_b"
  output: "convblock3_l3_input_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_conv1"
  input: "convblock3_l3_input_bn2_scale"
  input: "convblock3_l3_input_bn2_bias"
  input: "convblock3_l3_input_bn2_mean"
  input: "convblock3_l3_input_bn2_var"
  output: "convblock3_l3_input_bn2"
  output: "convblock3_l3_input_bn2_mean"
  output: "convblock3_l3_input_bn2_var"
  output: "convblock3_l3_input_bn2_saved_mean"
  output: "convblock3_l3_input_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_bn2"
  output: "convblock3_l3_input_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_bn2"
  input: "convblock3_l3_input_conv2_w"
  input: "convblock3_l3_input_conv2_b"
  output: "convblock3_l3_input_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_conv2"
  input: "convblock3_l3_input_bn3_scale"
  input: "convblock3_l3_input_bn3_bias"
  input: "convblock3_l3_input_bn3_mean"
  input: "convblock3_l3_input_bn3_var"
  output: "convblock3_l3_input_bn3"
  output: "convblock3_l3_input_bn3_mean"
  output: "convblock3_l3_input_bn3_var"
  output: "convblock3_l3_input_bn3_saved_mean"
  output: "convblock3_l3_input_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_bn3"
  output: "convblock3_l3_input_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_bn3"
  input: "convblock3_l3_input_conv3_w"
  input: "convblock3_l3_input_conv3_b"
  output: "convblock3_l3_input_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_conv1"
  input: "convblock3_l3_input_conv2"
  input: "convblock3_l3_input_conv3"
  output: "convblock3_l3_input_l3_b1"
  output: "_convblock3_l3_input_l3_b1_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input"
  output: "convblock3_l3_input_l3_b2_downsample"
  type: "AveragePool"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 2
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "legacy_pad"
    i: 3
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample"
  input: "convblock3_l3_input_l3_b2_downsample_bn1_scale"
  input: "convblock3_l3_input_l3_b2_downsample_bn1_bias"
  input: "convblock3_l3_input_l3_b2_downsample_bn1_mean"
  input: "convblock3_l3_input_l3_b2_downsample_bn1_var"
  output: "convblock3_l3_input_l3_b2_downsample_bn1"
  output: "convblock3_l3_input_l3_b2_downsample_bn1_mean"
  output: "convblock3_l3_input_l3_b2_downsample_bn1_var"
  output: "convblock3_l3_input_l3_b2_downsample_bn1_saved_mean"
  output: "convblock3_l3_input_l3_b2_downsample_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample_bn1"
  output: "convblock3_l3_input_l3_b2_downsample_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample_bn1"
  input: "convblock3_l3_input_l3_b2_downsample_conv1_w"
  input: "convblock3_l3_input_l3_b2_downsample_conv1_b"
  output: "convblock3_l3_input_l3_b2_downsample_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample_conv1"
  input: "convblock3_l3_input_l3_b2_downsample_bn2_scale"
  input: "convblock3_l3_input_l3_b2_downsample_bn2_bias"
  input: "convblock3_l3_input_l3_b2_downsample_bn2_mean"
  input: "convblock3_l3_input_l3_b2_downsample_bn2_var"
  output: "convblock3_l3_input_l3_b2_downsample_bn2"
  output: "convblock3_l3_input_l3_b2_downsample_bn2_mean"
  output: "convblock3_l3_input_l3_b2_downsample_bn2_var"
  output: "convblock3_l3_input_l3_b2_downsample_bn2_saved_mean"
  output: "convblock3_l3_input_l3_b2_downsample_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample_bn2"
  output: "convblock3_l3_input_l3_b2_downsample_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample_bn2"
  input: "convblock3_l3_input_l3_b2_downsample_conv2_w"
  input: "convblock3_l3_input_l3_b2_downsample_conv2_b"
  output: "convblock3_l3_input_l3_b2_downsample_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample_conv2"
  input: "convblock3_l3_input_l3_b2_downsample_bn3_scale"
  input: "convblock3_l3_input_l3_b2_downsample_bn3_bias"
  input: "convblock3_l3_input_l3_b2_downsample_bn3_mean"
  input: "convblock3_l3_input_l3_b2_downsample_bn3_var"
  output: "convblock3_l3_input_l3_b2_downsample_bn3"
  output: "convblock3_l3_input_l3_b2_downsample_bn3_mean"
  output: "convblock3_l3_input_l3_b2_downsample_bn3_var"
  output: "convblock3_l3_input_l3_b2_downsample_bn3_saved_mean"
  output: "convblock3_l3_input_l3_b2_downsample_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample_bn3"
  output: "convblock3_l3_input_l3_b2_downsample_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample_bn3"
  input: "convblock3_l3_input_l3_b2_downsample_conv3_w"
  input: "convblock3_l3_input_l3_b2_downsample_conv3_b"
  output: "convblock3_l3_input_l3_b2_downsample_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l3_b2_downsample_conv1"
  input: "convblock3_l3_input_l3_b2_downsample_conv2"
  input: "convblock3_l3_input_l3_b2_downsample_conv3"
  output: "convblock3_l3_input_l2_input"
  output: "_convblock3_l3_input_l2_input_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input"
  input: "convblock3_l3_input_l2_input_bn1_scale"
  input: "convblock3_l3_input_l2_input_bn1_bias"
  input: "convblock3_l3_input_l2_input_bn1_mean"
  input: "convblock3_l3_input_l2_input_bn1_var"
  output: "convblock3_l3_input_l2_input_bn1"
  output: "convblock3_l3_input_l2_input_bn1_mean"
  output: "convblock3_l3_input_l2_input_bn1_var"
  output: "convblock3_l3_input_l2_input_bn1_saved_mean"
  output: "convblock3_l3_input_l2_input_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_bn1"
  output: "convblock3_l3_input_l2_input_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_bn1"
  input: "convblock3_l3_input_l2_input_conv1_w"
  input: "convblock3_l3_input_l2_input_conv1_b"
  output: "convblock3_l3_input_l2_input_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_conv1"
  input: "convblock3_l3_input_l2_input_bn2_scale"
  input: "convblock3_l3_input_l2_input_bn2_bias"
  input: "convblock3_l3_input_l2_input_bn2_mean"
  input: "convblock3_l3_input_l2_input_bn2_var"
  output: "convblock3_l3_input_l2_input_bn2"
  output: "convblock3_l3_input_l2_input_bn2_mean"
  output: "convblock3_l3_input_l2_input_bn2_var"
  output: "convblock3_l3_input_l2_input_bn2_saved_mean"
  output: "convblock3_l3_input_l2_input_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_bn2"
  output: "convblock3_l3_input_l2_input_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_bn2"
  input: "convblock3_l3_input_l2_input_conv2_w"
  input: "convblock3_l3_input_l2_input_conv2_b"
  output: "convblock3_l3_input_l2_input_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_conv2"
  input: "convblock3_l3_input_l2_input_bn3_scale"
  input: "convblock3_l3_input_l2_input_bn3_bias"
  input: "convblock3_l3_input_l2_input_bn3_mean"
  input: "convblock3_l3_input_l2_input_bn3_var"
  output: "convblock3_l3_input_l2_input_bn3"
  output: "convblock3_l3_input_l2_input_bn3_mean"
  output: "convblock3_l3_input_l2_input_bn3_var"
  output: "convblock3_l3_input_l2_input_bn3_saved_mean"
  output: "convblock3_l3_input_l2_input_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_bn3"
  output: "convblock3_l3_input_l2_input_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_bn3"
  input: "convblock3_l3_input_l2_input_conv3_w"
  input: "convblock3_l3_input_l2_input_conv3_b"
  output: "convblock3_l3_input_l2_input_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_conv1"
  input: "convblock3_l3_input_l2_input_conv2"
  input: "convblock3_l3_input_l2_input_conv3"
  output: "convblock3_l3_input_l2_input_l2_b1"
  output: "_convblock3_l3_input_l2_input_l2_b1_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample"
  type: "AveragePool"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 2
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "legacy_pad"
    i: 3
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1_scale"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1_bias"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1_mean"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1_var"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1_mean"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1_var"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1_saved_mean"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn1"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv1_w"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv1_b"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv1"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2_scale"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2_bias"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2_mean"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2_var"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2_mean"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2_var"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2_saved_mean"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn2"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv2_w"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv2_b"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv2"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3_scale"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3_bias"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3_mean"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3_var"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3_mean"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3_var"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3_saved_mean"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_bn3"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv3_w"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv3_b"
  output: "convblock3_l3_input_l2_input_l2_b2_downsample_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv1"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv2"
  input: "convblock3_l3_input_l2_input_l2_b2_downsample_conv3"
  output: "convblock3_l3_input_l2_input_l1_input"
  output: "_convblock3_l3_input_l2_input_l1_input_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input"
  input: "convblock3_l3_input_l2_input_l1_input_bn1_scale"
  input: "convblock3_l3_input_l2_input_l1_input_bn1_bias"
  input: "convblock3_l3_input_l2_input_l1_input_bn1_mean"
  input: "convblock3_l3_input_l2_input_l1_input_bn1_var"
  output: "convblock3_l3_input_l2_input_l1_input_bn1"
  output: "convblock3_l3_input_l2_input_l1_input_bn1_mean"
  output: "convblock3_l3_input_l2_input_l1_input_bn1_var"
  output: "convblock3_l3_input_l2_input_l1_input_bn1_saved_mean"
  output: "convblock3_l3_input_l2_input_l1_input_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_bn1"
  output: "convblock3_l3_input_l2_input_l1_input_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_bn1"
  input: "convblock3_l3_input_l2_input_l1_input_conv1_w"
  input: "convblock3_l3_input_l2_input_l1_input_conv1_b"
  output: "convblock3_l3_input_l2_input_l1_input_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_conv1"
  input: "convblock3_l3_input_l2_input_l1_input_bn2_scale"
  input: "convblock3_l3_input_l2_input_l1_input_bn2_bias"
  input: "convblock3_l3_input_l2_input_l1_input_bn2_mean"
  input: "convblock3_l3_input_l2_input_l1_input_bn2_var"
  output: "convblock3_l3_input_l2_input_l1_input_bn2"
  output: "convblock3_l3_input_l2_input_l1_input_bn2_mean"
  output: "convblock3_l3_input_l2_input_l1_input_bn2_var"
  output: "convblock3_l3_input_l2_input_l1_input_bn2_saved_mean"
  output: "convblock3_l3_input_l2_input_l1_input_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_bn2"
  output: "convblock3_l3_input_l2_input_l1_input_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_bn2"
  input: "convblock3_l3_input_l2_input_l1_input_conv2_w"
  input: "convblock3_l3_input_l2_input_l1_input_conv2_b"
  output: "convblock3_l3_input_l2_input_l1_input_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_conv2"
  input: "convblock3_l3_input_l2_input_l1_input_bn3_scale"
  input: "convblock3_l3_input_l2_input_l1_input_bn3_bias"
  input: "convblock3_l3_input_l2_input_l1_input_bn3_mean"
  input: "convblock3_l3_input_l2_input_l1_input_bn3_var"
  output: "convblock3_l3_input_l2_input_l1_input_bn3"
  output: "convblock3_l3_input_l2_input_l1_input_bn3_mean"
  output: "convblock3_l3_input_l2_input_l1_input_bn3_var"
  output: "convblock3_l3_input_l2_input_l1_input_bn3_saved_mean"
  output: "convblock3_l3_input_l2_input_l1_input_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_bn3"
  output: "convblock3_l3_input_l2_input_l1_input_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_bn3"
  input: "convblock3_l3_input_l2_input_l1_input_conv3_w"
  input: "convblock3_l3_input_l2_input_l1_input_conv3_b"
  output: "convblock3_l3_input_l2_input_l1_input_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_conv1"
  input: "convblock3_l3_input_l2_input_l1_input_conv2"
  input: "convblock3_l3_input_l2_input_l1_input_conv3"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b1"
  output: "_convblock3_l3_input_l2_input_l1_input_l1_b1_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample"
  type: "AveragePool"
  arg {
    name: "stride"
    i: 2
  }
  arg {
    name: "pad"
    i: 0
  }
  arg {
    name: "kernel"
    i: 2
  }
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "legacy_pad"
    i: 3
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1_scale"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1_bias"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1_mean"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1_var"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1_var"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1_saved_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn1"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv1_w"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv1_b"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv1"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2_scale"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2_bias"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2_mean"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2_var"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2_var"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2_saved_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn2"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv2_w"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv2_b"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv2"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3_scale"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3_bias"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3_mean"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3_var"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3_var"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3_saved_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_bn3"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv3_w"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv3_b"
  output: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv3"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv1"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv2"
  input: "convblock3_l3_input_l2_input_l1_input_l1_b2_downsample_conv3"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input"
  output: "_convblock3_l3_input_l2_input_l1_input_l0_input_dims"
  type: "Concat"
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l0_input"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1_scale"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1_bias"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1_mean"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1_var"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1_var"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1_saved_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn1"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_conv1_w"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_conv1_b"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_conv1"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
    name: "pad"
    i: 1
  }
  arg {
    name: "kernel"
    i: 3
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_conv1"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2_scale"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2_bias"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2_mean"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2_var"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2_var"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2_saved_mean"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2_saved_var"
  type: "SpatialBN"
  arg {
    name: "is_test"
    i: 0
  }
  arg {
    name: "epsilon"
    f: 1e-05
  }
  arg {
    name: "momentum"
    f: 0.9
  }
  arg {
    name: "order"
    s: "NCHW"
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2"
  type: "LeakyRelu"
  arg {
    name: "alpha"
    f: 0.2
  }
}
op {
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_bn2"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_conv2_w"
  input: "convblock3_l3_input_l2_input_l1_input_l0_input_conv2_b"
  output: "convblock3_l3_input_l2_input_l1_input_l0_input_conv2"
  type: "Conv"
  arg {
    name: "stride"
    i: 1
  }
  arg {
